physics = ['''Масса измеряется в
    А) Ньютонах
    Б) Килограммах
    В) Джоулях
    ''',
           '''Скорость движения машины 36 км/ч. В единицах системы СИ составляет
А) 10 м/с
Б) 600 м/с
В) 20 м/с
''',
           '''Вес тела - это сила,
А) с которой тело притягивается к Земле
Б) с которой тело вследствие притяжения к Земле действует на опору или подвес
В) с которой тело действует на другое тело, вызывающее деформацию
''',
           '''Для измерения массы тела используют
А) Термометр
Б) Весы
В) Секундомер
''',
           '''Работа, совершаемая человеком при подъёме груза весом 6Н на высоту 2 метра, равна
А) 3 Дж
Б) 8 Дж
В) 12 Дж
''',
           '''Температура тела зависит от:
     А) Размеров тела
     Б) Скорости движения молекул
     В) Скорости движения тела
    ''',
           '''2.К тепловым явлениям относятся:
А) Движение Земли вокруг Солнца;
Б) Падение мяча на землю;
В) Нагревание воды в чайнике;
''',
           '''Как называют количество тепла, которое необходимо для нагревания вещества массой 1 кг на 1°С?
А) Теплопередачей
Б) Удельной теплоемкостью этого вещества
В) Изменением внутренней энергии
''',
           '''Электрическим током называют
А) Движение заряженных частиц
Б) Направленное движение частиц
В) Направленное движение заряженных частиц
''',
           '''Электрическая лампа, сопротивление которой 240 Ом, горит полным накалом при силе тока 0,5 А.
                   Чему равно напряжение на зажимах лампы?
А) 220 В
Б) 130 В
В) 120 В
''',
           '''
    Силы, с которыми два тела действуют друг на друга, равны по модулю и противоположны по направлению
    Какой это закон Ньютона?
    А) Первый
    Б) Второй
    В) Третий
    ''',
           '''
При свободных колебаниях шар на нити проходит путь от крайнего левого положения до положения равновесия за 0,1 с. Каков 
период колебаний шара?
А) 0,2 с
Б) 0,3 с
В) 0,4 с''',
           '''
Спортсмен пробежал дистанцию 400 метров по дорожке стадиона и возвратился к месту старта. Чему равен путь l, пройденный 
спортсменом,и модуль его перемещения S
А) l = 0, S = 400
Б) l = 400, S = 0
В) l = 400, S = 400''',
           '''
Велосипедист, двигаясь равномерно, проезжает 20 м за 2 с. Определите, какой путь он проедет при движении с той же скорос
тью за 10с.
А) 60м 
Б) 100м 
В) 150м''',
           '''
9 класс:
Пружинный маятник за 4 секунды совершил 16 полных колебаний. Частота колебаний маятника равна:
А) 4 Гц
Б) 0.25 Гц
В) 0.1 Гц''']

physics_ans = ['Б', 'А', 'Б', 'Б', 'В', 'Б', 'В', 'Б', 'В', 'В', 'В', 'В', 'Б', 'Б', 'Б']


inf = [
    '''К какому блоку клавиш клавиатуры, относятся клавиши F1-F12 ?
    А)Символьные клавиши                                                                       
    Б)Клавиши дополнительной клавиатуры
    В)Специальные клавиши
    Г)Функциональные клавиши
    ''',
    '''Как называется глобальная компьютерная сеть, связывающая компьютеры по всему миру?
А)Локальная сеть                                                           
Б)Яндекс
В)Google
Г)Интернет
''',
    '''Какое центральное устройство компьютера обрабатывает информацию?
А)Блок питания
Б)Оперативная память
В)Процессор
Г)Жесткий диск
''',
    '''При выключении компьютера вся информация стирается:
А)На компакт диске
Б)В оперативной памяти
В)На жестком диске
Г)На гибком диске
''',
    '''Жёсткий диск является:
А)Внешней памятью
Б)Оперативной памятью
В)Устройством управления
Г)Арифметическим устройством
''',
    '''
    Основные логические операции:
    А)Конъюнкция,  Дизъюнкция,  Инверсия
    Б)Формализация,  Инверсия,                                                             
    В)Конъюнкция,  Импликация.
    Г)Дизъюнкция, Конъюнкция,  Формализация
    ''',
    '''
Логическая операция, ставящая в соответствие каждым двум простым (или исходным) высказываниям составное высказывание, яв
ляющееся истинным тогда и только тогда, когда оба исходных высказывания истинны называется …
А)Форматизация                                                                       
Б)Алгебра Логики
В)Конъюнкция   
Г)Дизъюнкция
''',
    '''
Логическая операция, которая каждым двум простым (или исходным) высказываниям ставит в соответствие составное высказыван
ие, являющееся ложным тогда и только тогда, когда оба исходных высказывания ложны и истинным, когда хотя бы одно из двух
 образующих его высказываний истинно называется …
А)Формализация
Б)Дизъюнкция 
В)Инверсия
Г)Конъюнкция''',
    '''
Операция логического умножения - это операция
А)Импликации
Б)Инверсии
В)Конъюнкции
Г)Дизъюнкции''',
    '''
Учебник по математике содержит информацию следующих видов:
А)Графическую, текстовую и звуковую
Б)Графическую, звуковую и числовую
В)Графическую, текстовую и числовую
Г)Исключительно числовую информацию
''',
    '''
    Индексом элемента называется…
    А)Номер элемента в массиве
    Б)Последний элемент в массиве
    В)Значение элемента массива
    Г)Номер первого и последнего элемента массива
    ''',
    '''
Что такое массив?
А)Набор чисел, расставленных в порядке возрастания.
Б)Набор данных, которые имеют порядковый тип.
В)Совокупность однотипных данных, хранящихся в последовательных ячейках памяти.
Г)Табличные данные.
''',
    '''
Массив данных имеет
А)Один тип и разные значения
Б)Общее имя и один тип
В)Общее имя, один тип, разные значения
Г)Один тип''',
    '''
Алгоритм называется линейным, если
А)Его выполнение предполагает многократное повторение одних и тех же действий
Б)Ход его выполнения зависит от истинности тех или иных условий
В)Команды выполняются в порядке их естественного следования друг за другом независимо от каких- либо условий
Г)Он представим в табличной форме''',
    '''
Алгоритм называется циклическим, если
А)Его выполнение предполагает многократное повторение одних и тех же действий
Б)Ход его выполнения зависит от истинности тех или иных условий
В)Команды выполняются в порядке их естественного следования друг за другом независимо от каких-либо условий
Г)Он представим в табличной форме
''']

inf_ans = ['Г', 'Г', 'В', 'Б', 'А', 'А', 'В', 'Б', 'В', 'Г', 'А', 'В', 'Б', 'Б', 'А']

math = [
               '''
    Как называется вертикальная ось координат?
    А) Ось ординат 
    Б) Ось абсцисс  
    В) Ось Z
    ''',
               '''
Утверждение, требующее доказательства?
А) Теорема.
Б) Аргумент.
В) Аксиома.
''',
               '''
Выражение находящееся над дробной чертой?
А) Значение.
Б) Числитель.
В) Корень.
''',
               '''
7 класс:
Число 5^3 = ?
А) 15
Б) 8
В) 125''',
               '''
    Чему равна площадь квадрата со стороной 2?
    А) 2
    Б) 4
    В) 8
    ''',
               '''
Сумма всех углов треугольника?
А) 180
Б) 90
В) 360
''',
               '''
Вторая степень числа?
А) Куб.
Б) Дробь.
В) Квадрат''',
               '''
Число а^0 = ?
А) 0
Б) 1
В) а
''',
               '''
    Сократите дробь 16/24.
    А) 2/5
    Б) 2/3
    В) 1/3
    ''',
               '''
Числа расположенные правее нуля?
А) Положительные.
Б) Простые.
В) Отрицательные.
''',
               '''
График квадратичной функции?
А) Прямая
Б) Гиберпола
В) Порабола''',
               '''
Прямая, имеющая с окружностью две общие точки?
А) Касательная.
Б) Секущая.
В) Диагональ.
''',
               '''фф выфв''',
               '''asdasd''',
               'asdadada']
math_ans = ['Б', 'А', 'Б', 'В', 'Б', 'А', 'В', 'Б', 'Б', 'А', 'В', 'Б', 'А', 'А', 'А']

rus = [
              '''
    Укажите предложение, в котором есть деепричастный оборот.
    А) В течение двух недель, проведенных в пути, мы с мамой выходили только на перроны больших городов.
    Б) Небо выяснилось и, синея, мерцало холодным узором звёзд.
    В) На берегах безымянных рек, оставшись без горючего, разбросал свои пушки артиллерийский полк.
    ''',
              '''
Какое слово пишется через дефис?
А)(по) немногу
Б)(по) прежнему
В)(в) двоем
''',
              '''
Укажите предложение без пунктуационной ошибки.
А) От уха к уху бежит по цепи шёпот переданный от передового.
Б) Распорядитель охоты разводит и ставит на, обозначенные им, номера участников охоты.
В) После выстрела, прозвучавшего в лесу одиноко, зверь опустился на снег.
''',
              '''
Укажите неправильное утверждение:
А) Причастия бывают совершенного и несовершенного вида.
Б) Наречие обозначает признак действия.
В) Деепричастия изменяются по лицам и числам.
''',
              '''
Укажите предлог, который пишется слитно:
А) (в)заключение 
Б) (в)связи 
В) (на)счет
''',
              '''
    Укажите словосочетание со связью примыкание:
    А) стройная девушка 
    Б) изучаем в школе
    В) можно вспомнить
    ''',
              '''
Укажите словосочетание со связью управление:
А) всегда готов 
Б) отважный пес
В) вырос в поле 
''',
              '''
Укажите предложение, в котором сказуемое является составным именным:
А) Мы должны это уметь. 
Б) Она сидела задумчивая.
В) Я буду рад вас видеть.
''',
              '''
Укажите предложение, в котором сказуемое является простым глагольным:
А) На наезднике была куртка. 
Б) Это был ее новый наряд.
В) Это была наша новая учительница. 
Г) Соловей перестал петь в клетке.
''',
              '''
Укажите словосочетание со связью согласование:
А) законы языка 
Б) те мысли
Б) рад стараться 
''',
              '''
     В каком ряду в обоих словах на месте пропуска пишется буква И?
    А) газ..фикация, обл..чать
    Б) лаб..ринт, оранж..рея
    В) ид..ология, ин..циатива
    ''',
              '''
В каком ряду в обоих словах на месте пропуска пишутся две согласные буквы?
А)инте..игентный, га..ерея
Б) ко..ентатор, гу..анизм
В) а..омпанемент, коло..альный
''',
              '''
Назовите основной знак препинания для предложений с союзной связью.
А) Тире
Б) Двоеточие
В) Запятая
''',
              '''
 В каком ряду в обоих словах верно выделена буква, обозна чающая ударный гласный звук?
А) бАловать, обострИть
Б) докумЕнт, началА
В) осужденА, квАртал
''',
              '''
В каких союзных сложных предложениях все части равноправны между собой?
 А) Сложносочиненных и сложноподчиненных
 Б) Сложносочиненных
 В) Сложноподчиненных
''']

rus_ans = ['В', 'Б', 'В', 'В', 'В', 'В', 'В', 'Б', 'А', 'Б', 'А', 'В', 'В', 'В', 'Б']
